{"backend": "tensorflow", "config": {"output_layers": [["dense_2", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 784], "sparse": false, "dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"kernel_initializer": {"config": {"distribution": "truncated_normal", "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "trainable": true, "bias_regularizer": null, "dtype": "float32", "name": "dense", "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 256}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "dense", "class_name": "Dense"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "rate": 0.050000000000000044, "dtype": "float32", "name": "dropout"}, "inbound_nodes": [[["dense", 0, 0, {}]]], "name": "dropout", "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "truncated_normal", "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "trainable": true, "bias_regularizer": null, "dtype": "float32", "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 256}, "inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "rate": 0.050000000000000044, "dtype": "float32", "name": "dropout_1"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "truncated_normal", "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "softmax", "trainable": true, "bias_regularizer": null, "dtype": "float32", "name": "dense_2", "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 10}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "name": "model"}, "keras_version": "2.1.6-tf", "class_name": "Model"}